In [2]:
import pandas as pd

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [3]:
sc1 = pd.read_csv("Sc_1.csv")

In [4]:
sc2 = pd.read_csv("Sc_2.csv")

In [5]:
sc3 = pd.read_csv("Sc_3.csv")

In [6]:
sc1

    Chr  Start_pos  End_pos
0  chr1       1001     2001
1  chr1       1002     2002
2  chr1       1003     2003
3  chr2       1004     2004
4  chr2       1005     2005
5  chr2       1005     2006

In [7]:
sc2

    Chr  Start_pos  End_pos
0  chr1       1001     2001
1  chr1       1002     2002
2  chr1       1006     2003
3  chr2       1004     2004
4  chr2       1005     2005
5  chr2       1005     2007

In [8]:
sc3

    Chr  Start_pos  End_pos
0  chr1       1001     2010
1  chr1       1009     2002
2  chr1       1003     2003
3  chr2       1004     2004
4  chr2       1005     2005
5  chr2       1005     2006

In [9]:
pysqldf("Select count(*) from sc1, sc2 \
    WHERE sc1.Chr = sc2.Chr \
    AND sc1.Start_pos = sc2.Start_pos \
    AND sc1.End_pos = sc2.End_pos")

   count(*)
0         4

In [11]:
pysqldf("Select * from sc1 \
    JOIN sc2 \
    ON sc1.Chr = sc2.CHR \
    AND sc1.Start_pos = sc2.Start_pos \
    AND sc1.End_pos = sc2.End_pos \
    WHERE sc1.End_pos > 2001")

    Chr  Start_pos  End_pos   Chr  Start_pos  End_pos
0  chr1       1002     2002  chr1       1002     2002
1  chr2       1004     2004  chr2       1004     2004
2  chr2       1005     2005  chr2       1005     2005